; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v9 ?v12)
             (pred_1 ?v8 ?v5)
             (pred_12 ?v9 ?v5)
             (pred_10 ?v10 ?v9 )
	     (pred_11 ?v9)
             (pred_9 ?v6)
             (pred_7 ?v8)
             (pred_5 ?v5)
             (pred_3 ?v9)
             (pred_6 ?v8)
             (pred_8 ?v9)
             (pred_2 ))



(:action op_1
:parameters (?v2 ?v13 ?v1 ?v4)
:precondition (and (pred_9 ?v2) (pred_9 ?v13) (pred_7 ?v1) (pred_5 ?v4)
          (pred_4 ?v2 ?v13) (pred_1 ?v1 ?v4)
                   (pred_12 ?v13 ?v4) (pred_11 ?v2) 
                   (pred_3 ?v13) (pred_6 ?v1))
:effect (and  (pred_8 ?v13) (not (pred_3 ?v13))))


(:action op_4
:parameters (?v2 ?v11)
:precondition (and (pred_9 ?v2) (pred_9 ?v11)
               (pred_11 ?v2) (pred_4 ?v2 ?v11) (pred_8 ?v11))
:effect (and (pred_11 ?v11) (not (pred_11 ?v2))))

(:action op_3
:parameters (?v2 ?v1)
:precondition (and (pred_9 ?v2) (pred_7 ?v1) 
                  (pred_11 ?v2) (pred_10 ?v1 ?v2) (pred_2 ))
:effect (and (pred_6 ?v1)
   (not (pred_10 ?v1 ?v2)) (not (pred_2 ))))


(:action op_5
:parameters (?v2 ?v3 ?v7)
:precondition (and (pred_9 ?v2) (pred_7 ?v3) (pred_7 ?v7)
                  (pred_11 ?v2) (pred_6 ?v7) (pred_10 ?v3 ?v2))
:effect (and (pred_6 ?v3) (pred_10 ?v7 ?v2)
        (not (pred_6 ?v7)) (not (pred_10 ?v3 ?v2))))

(:action op_2
:parameters (?v2 ?v1)
:precondition (and (pred_9 ?v2) (pred_7 ?v1) 
                  (pred_11 ?v2) (pred_6 ?v1))
:effect (and (pred_2 ) (pred_10 ?v1 ?v2) (not (pred_6 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_07 obj_05 obj_14 obj_21 obj_28 obj_10 obj_19 obj_13 obj_06 obj_26 obj_29 obj_08 obj_09 obj_20 obj_25 obj_18 obj_23 obj_27 obj_17 obj_01 obj_16 obj_22 obj_30 obj_02
    obj_03 obj_11
    obj_24 obj_04 obj_15
    )

    (:init
       (pred_2)

       (pred_9 obj_12)
       (pred_9 obj_07)
       (pred_9 obj_05)
       (pred_9 obj_14)
       (pred_9 obj_21)
       (pred_9 obj_28)
       (pred_9 obj_10)
       (pred_9 obj_19)
       (pred_9 obj_13)
       (pred_9 obj_06)
       (pred_9 obj_26)
       (pred_9 obj_29)
       (pred_9 obj_08)
       (pred_9 obj_09)
       (pred_9 obj_20)
       (pred_9 obj_25)
       (pred_9 obj_18)
       (pred_9 obj_23)
       (pred_9 obj_27)
       (pred_9 obj_17)
       (pred_9 obj_01)
       (pred_9 obj_16)
       (pred_9 obj_22)
       (pred_9 obj_30)
       (pred_9 obj_02)
       (pred_5 obj_03)
       (pred_5 obj_11)
       (pred_7 obj_24)
       (pred_7 obj_04)
       (pred_7 obj_15)

       (pred_4 obj_12 obj_28)
       (pred_4 obj_12 obj_07)
       (pred_4 obj_07 obj_10)
       (pred_4 obj_07 obj_05)
       (pred_4 obj_07 obj_12)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_05 obj_14)
       (pred_4 obj_05 obj_07)
       (pred_4 obj_14 obj_13)
       (pred_4 obj_14 obj_21)
       (pred_4 obj_14 obj_05)
       (pred_4 obj_21 obj_06)
       (pred_4 obj_21 obj_14)
       (pred_4 obj_28 obj_26)
       (pred_4 obj_28 obj_10)
       (pred_4 obj_28 obj_12)
       (pred_4 obj_10 obj_29)
       (pred_4 obj_10 obj_19)
       (pred_4 obj_10 obj_07)
       (pred_4 obj_10 obj_28)
       (pred_4 obj_19 obj_08)
       (pred_4 obj_19 obj_13)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_19 obj_10)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_06)
       (pred_4 obj_13 obj_14)
       (pred_4 obj_13 obj_19)
       (pred_4 obj_06 obj_20)
       (pred_4 obj_06 obj_21)
       (pred_4 obj_06 obj_13)
       (pred_4 obj_26 obj_25)
       (pred_4 obj_26 obj_29)
       (pred_4 obj_26 obj_28)
       (pred_4 obj_29 obj_18)
       (pred_4 obj_29 obj_08)
       (pred_4 obj_29 obj_10)
       (pred_4 obj_29 obj_26)
       (pred_4 obj_08 obj_23)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_08 obj_19)
       (pred_4 obj_08 obj_29)
       (pred_4 obj_09 obj_27)
       (pred_4 obj_09 obj_20)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_09 obj_08)
       (pred_4 obj_20 obj_17)
       (pred_4 obj_20 obj_06)
       (pred_4 obj_20 obj_09)
       (pred_4 obj_25 obj_01)
       (pred_4 obj_25 obj_18)
       (pred_4 obj_25 obj_26)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_18 obj_23)
       (pred_4 obj_18 obj_29)
       (pred_4 obj_18 obj_25)
       (pred_4 obj_23 obj_22)
       (pred_4 obj_23 obj_27)
       (pred_4 obj_23 obj_08)
       (pred_4 obj_23 obj_18)
       (pred_4 obj_27 obj_30)
       (pred_4 obj_27 obj_17)
       (pred_4 obj_27 obj_09)
       (pred_4 obj_27 obj_23)
       (pred_4 obj_17 obj_02)
       (pred_4 obj_17 obj_20)
       (pred_4 obj_17 obj_27)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_01 obj_25)
       (pred_4 obj_16 obj_22)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_22 obj_30)
       (pred_4 obj_22 obj_23)
       (pred_4 obj_22 obj_16)
       (pred_4 obj_30 obj_02)
       (pred_4 obj_30 obj_27)
       (pred_4 obj_30 obj_22)
       (pred_4 obj_02 obj_17)
       (pred_4 obj_02 obj_30)
       (pred_3 obj_01)
       (pred_3 obj_02)
       (pred_3 obj_18)
       (pred_12  obj_01 obj_03)
       (pred_12  obj_02 obj_11)
       (pred_12  obj_18 obj_03)
       (pred_8 obj_12)
       (pred_8 obj_07)
       (pred_8 obj_05)
       (pred_8 obj_14)
       (pred_8 obj_21)
       (pred_8 obj_28)
       (pred_8 obj_10)
       (pred_8 obj_19)
       (pred_8 obj_13)
       (pred_8 obj_06)
       (pred_8 obj_26)
       (pred_8 obj_29)
       (pred_8 obj_08)
       (pred_8 obj_09)
       (pred_8 obj_20)
       (pred_8 obj_25)
       (pred_8 obj_23)
       (pred_8 obj_27)
       (pred_8 obj_17)
       (pred_8 obj_16)
       (pred_8 obj_22)
       (pred_8 obj_30)

       (pred_1  obj_24 obj_03)
       (pred_1  obj_04 obj_11)
       (pred_1  obj_15 obj_11)
       (pred_10 obj_24 obj_06)
       (pred_10 obj_04 obj_30)
       (pred_10 obj_15 obj_12)
       (pred_11 obj_05)
    )

    (:goal (and
       (pred_10 obj_15 obj_29)
    ))
(:constraints
  (always (not (pred_11 obj_07)))
)
)

; plan
1. (op_4 obj_05 obj_19)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_19)
   goals met: 0 of 1
2. (op_4 obj_19 obj_10)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_10)
   goals met: 0 of 1
3. (op_4 obj_10 obj_28)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_28)
   goals met: 0 of 1
4. (op_4 obj_28 obj_12)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_12)
   goals met: 0 of 1
5. (op_3 obj_12 obj_15)
   deleted: (pred_10 obj_15 obj_12) (pred_2)
   added: (pred_6 obj_15)
   goals met: 0 of 1
6. (op_4 obj_12 obj_28)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_28)
   goals met: 0 of 1
7. (op_4 obj_28 obj_10)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_10)
   goals met: 0 of 1
8. (op_4 obj_10 obj_29)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_29)
   goals met: 0 of 1
9. (op_2 obj_29 obj_15)
   deleted: (pred_6 obj_15)
   added: (pred_2) (pred_10 obj_15 obj_29)
   goals met: 1 of 1
